         # 1st program
print((9*5)**0,5)
         # 2nd program
print(9.99 > 9.98 and 1000 != 1000.1)
         # 3rd program
print(1234 % 1000 // 10 + 5678 % 1000 // 10)
         # 4th program
print(13.42 // 1 == int(42.13 % 1 * 100) or (((int(13.42 * 100)) % 1000 % 100) == (42.13 // 1)))
# для проверки того, что оба выражения True, проведём проверку каждой части по отдельности
print(13.42 // 1 == int(42.13 % 1 * 100))
print(((int(13.42 * 100)) % 1000 % 100) == (42.13 // 1))
print((13.42 * 100) % 1000 % 100)
print(42.13 // 1)
